class InCartModel {
//  "status": true,
//     "message": "تمت الإضافة بنجاح",
//     "data": {
//         "id": 14988,
//         "quantity": 1,
//         "product": {
//             "id": 56,
//             "price": 32860,
//             "old_price": 35000,
//             "discount": 6,
//             "image": "https://student.valuxapps.com/storage/uploads/products/1615450256e0bZk.item_XXL_7582156_7501823.jpeg",
//             "name": "نيكون FX-format D750 - 24.3 ميجابيكسيل,كاميرا اس ال ار , عدسه 24-120 ملم, اسود",
//             "description": "كاميرا نيكون FX-format D750 تأتي محملة بخصائص متطورة تمنحك التحكم الكامل لتتمكن من التقاط الصور الواضحة للحظات حياتك. هذه الكاميرا صغيرة الحجم تأتي مع عدسة NIKKOR 24 - 120 ملم المثالية لالتقاط صور شخصية و صور للمناظر الطبيعية و صور حفلات الزفاف. على الرغم من ان هذا الجهاز صغير وخفيف الوزن لكنه يمنحك اداء ممتاز. استشعار CMOS بعدسة 24.3 ميغا بكسل و محرك EXPEED 4 يمنحانك القدرة على التقاط صور و مقاطع فيديو ممتازة حتى في ظروف الاضاءة المحيطة الخافتة. لهذه الكاميرا السوداء قائمة تصوير افلام مع إعدادات تحكم لتتمكن من تسجيل افلام 1080/60بكسل بوضوح فل اتش دي مع الحد الادنى من التموّج و التشويش. و تضم كاميرا نيكون FX-format D750 شاشة تي اف تي ال سي دي حجمها 3.2 انش و تعمل بدقة 1229K نقطة، لتتمكن من التقاط صور من زوايا مختلفة او اعادة عرض ما قمت بتصويره. واي فاي المدمج بهذه الكاميرا يمكنك من مشاركة الصور التي تلتقطها و الفيديوهات مع العالم. كل هذه الخصائص و اكثر تجعل كاميرا نيكون FX-format D750 مثالية للمصورين المحترفين و الشبه محترفين."
//         }
//     }

  late bool status;
  late String message;

  InCartModel.fromJSON(Map<String, dynamic> json) {
    status = json['status'];
    message = json['message'];
  }
}
